Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРасчетаРыночнойСтавкиПоВидамАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаПроверкиСущественностиОтклонений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОпределенияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодичностиОпределенияРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьТолькоПриПервоначальномПризнании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаБанков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляОтбораРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияДатыКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДатыСобытийПриПримененииРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантыРасчетаРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаРыночнойСтавкиПоДепозитамНФО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляПроверкиНаРыночность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиВПроцентныхПунктах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникТаблицыСоответствияРейтингов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеКредитногоСпреда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПоказыватьОтрицательныеПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляРасчетаДисконтированногоПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЭСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьПоПеречнюЦБ580П</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНаблюдаемыхПроцентныхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеСтандартногоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаКорректировкиЭСП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьЛинейноНерыночныеАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиНаДатуРазмещенияАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИгнорироватьИзменениеКлючевойСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаКоэффициентаВолатильности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаКоэффициентаВолатильности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСредневзвешеннойРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредневзвешенныхСтавок</v8:Type>
						<v8:Type>cfg:CatalogRef.БиржевыеИндексы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьГраницДиапазонаРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокАктиваДляИспользованияСхемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРасчетаОценочнойСтоимости</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивовДляПроверкиНаРыночность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеСтоимостиПоЭСППоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКлючевойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроверять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчитатьПоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагентИлиСтавкаРыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛинейноИПоФактическойЭСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоМетодикеКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КБДИMosPrime1День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНеРеализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаПрекратилаДействие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыАктивовДляПроверкиНаРыночность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАктивовДляПроверкиНаРыночность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Депозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямоеРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбратноеРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаймыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаймыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженностьПоДолгосрочнойАренде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КриваяБезрисковойДоходности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентВолатильностиРычнонойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартноеОтклонениеПоГенеральнойСовокупности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	ЗаполнитьСвязьЭлементовИРесурсов();
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	Элементы.СхемаПроверкиСущественностиОтклонений.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхСхем(Запись.ВидАктива));
	
	ОграничениеВариантаОтклоненияОтРыночнойСтавки(Элементы.ВариантОтклоненияОтРыночнойСтавки, Запись.СхемаПроверкиСущественностиОтклонений);
	
	ВидимостьРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьРеквизитов(Форма, ОбновитьСписокИспользуемыхРесурсов = Истина)
	
	ДанныеЗаписи	= Форма.Запись;
	Элементы     	= Форма.Элементы;
	
	Если ОбновитьСписокИспользуемыхРесурсов Тогда
		Форма.СписокИспользуемыхРесурсов = ПолучитьИспользуемыеРесурсы(ДанныеЗаписи);
	КонецЕсли;
	
	Для Каждого Связь Из Форма.СвязьЭлементовИРесурсов Цикл
		Элементы[Связь.Значение].Видимость = Форма.СписокИспользуемыхРесурсов.НайтиПоЗначению(Связь.Представление).Пометка;
	КонецЦикла;
	
	Если Элементы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчетаРЕПОСЦК.Видимость Тогда
		
		Элементы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчетаРЕПОСЦК.Видимость
			= (ДанныеЗаписи.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагент")
				И (ДанныеЗаписи.ВидАктива = ПредопределенноеЗначение("Перечисление.ВидыАктивовДляПроверкиНаРыночность.ПрямоеРЕПО")
					ИЛИ ДанныеЗаписи.ВидАктива = ПредопределенноеЗначение("Перечисление.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО")));
			
		Элементы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета.Видимость = НЕ Элементы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчетаРЕПОСЦК.Видимость;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИспользуемыеРесурсы(ДанныеЗаписи)
	
	Возврат РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИспользуемыеИзмеренияИРесурсы(ДанныеЗаписи);
	
КонецФункции

#Область ИспользуемыеРесурсы

&НаСервере
Процедура ЗаполнитьСвязьЭлементовИРесурсов()
	
	Ресурсы		= Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Ресурсы;
	Измерения	= Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Измерения;
	
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			НайденныРесурс = Ресурсы.Найти(СтрЗаменить(Элемент.ПутьКДанным, "Запись.", ""));
			Если НайденныРесурс <> Неопределено Тогда
				СвязьЭлементовИРесурсов.Добавить(Элемент.Имя, НайденныРесурс.Имя);
			КонецЕсли;
			
			НайденноеИзмерение = Измерения.Найти(СтрЗаменить(Элемент.ПутьКДанным, "Запись.", ""));
			Если НайденноеИзмерение <> Неопределено Тогда
				СвязьЭлементовИРесурсов.Добавить(Элемент.Имя, НайденноеИзмерение.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНеиспользуемыеРесурсы()
	
	Для Каждого Ресурс Из СписокИспользуемыхРесурсов Цикл
		Если НЕ Ресурс.Пометка И ЗначениеЗаполнено(Запись[Ресурс.Значение]) Тогда
			Запись[Ресурс.Значение] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВариантОтклоненияОтРыночнойСтавкиПриИзменении(Элемент)
	
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаПроверкиСущественностиОтклоненийПриИзменении(Элемент)
	
	ОграничениеВариантаОтклоненияОтРыночнойСтавки(Элементы.ВариантОтклоненияОтРыночнойСтавки, Запись.СхемаПроверкиСущественностиОтклонений, Запись.ВариантОтклоненияОтРыночнойСтавки);
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьЛинейноНеРыночныеАктивыПриИзменении(Элемент)
	
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАктиваДляДисконтированияПриИзменении(Элемент)
	
	Элементы.СхемаПроверкиСущественностиОтклонений.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхСхем(Запись.ВидАктива));
	
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорироватьИзменениеКлючевойСтавкиПриИзменении(Элемент)
	
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхСхем(ВидАктива)
	
	Возврат РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПолучитьМассивДоступныхСхем(ВидАктива);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьИспользуемыеРесурсы(Команда)
	
	Если СписокИспользуемыхРесурсов.ОтметитьЭлементы("Используемые ресурсы") Тогда
		ВидимостьРеквизитов(ЭтаФорма, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОграничениеВариантаОтклоненияОтРыночнойСтавки(ЭлементВариантОтклоненияОтРыночнойСтавки, СхемаПроверкиСущественностиОтклонений, ВариантОтклоненияОтРыночнойСтавки = Неопределено)
	
	НовыеПараметрыВыбора = Новый Массив;
	
	Если СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке") Тогда
		НовыеПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ПредопределенноеЗначение("Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.Фиксированный")));
		
		Если ВариантОтклоненияОтРыночнойСтавки <> ПредопределенноеЗначение("Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.Фиксированный") Тогда
			ВариантОтклоненияОтРыночнойСтавки = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементВариантОтклоненияОтРыночнойСтавки.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
	
КонецПроцедуры


&НаКлиенте
Процедура ВидСредневзвешеннойРыночнойСтавкиНФОПриИзменении(Элемент)
	
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодичностьОпределенияРыночнойСтавкиПриИзменении(Элемент)
	ВидимостьРеквизитов(ЭтаФорма);
	ОчиститьНеиспользуемыеРесурсы();
КонецПроцедуры
